/*
 * 简答题
 * 1、谈谈你对工程化的初步认识， 结合你之前遇到过的问题说出三个以上工程化能够解决的问题或者带来的价值。
 * 2、你认为脚手架除了为我们创建项目结构，还有什么更深的意义。 
 */

 /*
  * 1、前端工程化是通过使用软件工程方式来统一将前端开发流程、技术等规范化与标准化，可以提高开发效率，减少重复性工作。
  *    1）前端工程化能够提供集成的环境用来运行或使用各种拓展技术或依赖。
  *    2）前端工程化能够提高开发效率，减少重复工作，自动化完成代码编码打包、上传的工作。
  *    3）能够为多人协作提供统一的标准或规范，提高代码质量，减少bug。
  *    4）能够处理现有语言语法存在的兼容性等问题。     
  *
  * 2、脚手架能够通过创建项目结构实现相同类型或依赖相同框架项目的
  *    开发风格统一化，等同于提供了一个开发标准或规范；
  *    脚手架通常集成了很多开发需要的依赖、基础配置以及基础代码，够大大提高我们的开发效率，减少重复性工作；
  *    脚手架工具还增加了项目代码的可理解性，减少了一定的开发成本，当不同的人接手项目时能够快速理解结构。  
  */

  